{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "input_dtype": "int32", "sparse": false, "name": "main_input"}, "inbound_nodes": [], "name": "main_input"}, {"class_name": "Embedding", "config": {"trainable": true, "name": "embedding_1", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "input_dim": 10000, "batch_input_shape": [null, 20], "W_regularizer": null, "dropout": 0.0, "output_dim": 200, "input_length": 20}, "inbound_nodes": [[["main_input", 0, 0]]], "name": "embedding_1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_2", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["embedding_1", 0, 0]]], "name": "batchnormalization_2"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["batchnormalization_2", 0, 0]]], "name": "dropout_1"}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 20, 200], "sparse": false, "input_dtype": "float32", "name": "input_1"}, "name": "input_1"}, {"class_name": "Convolution1D", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"input_length": null, "W_constraint": null, "b_constraint": null, "name": "convolution1d_1", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "glorot_uniform", "bias": true, "nb_filter": 100, "input_dim": null, "subsample_length": 1, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "border_mode": "same"}, "name": "convolution1d_1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution1d_1", 0, 0]]], "config": {"gamma_regularizer": null, "name": "batchnormalization_1", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batchnormalization_1"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "config": {"stride": 2, "pool_length": 2, "trainable": true, "name": "maxpooling1d_1", "border_mode": "valid"}, "name": "maxpooling1d_1"}, {"class_name": "LSTM", "inbound_nodes": [[["maxpooling1d_1", 0, 0]]], "config": {"U_regularizer": null, "input_length": null, "name": "lstm_1", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "init": "glorot_uniform", "stateful": false, "unroll": false, "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "consume_less": "cpu", "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "input_dim": 100, "forget_bias_init": "one", "output_dim": 100}, "name": "lstm_1"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["lstm_1", 0, 0]]}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "model_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 100, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 90}, "inbound_nodes": [[["model_1", 1, 0]]], "name": "dense_1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_3", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["dense_1", 0, 0]]], "name": "batchnormalization_3"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["batchnormalization_3", 0, 0]]], "name": "dropout_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "activation_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 90, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 21}, "inbound_nodes": [[["activation_1", 0, 0]]], "name": "dense_2"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["dense_2", 0, 0]]], "name": "activation_2"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["model_1", 1, 0], ["activation_2", 0, 0]]], "name": "merge_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 121, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 90}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "dense_3"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_4", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["dense_3", 0, 0]]], "name": "batchnormalization_4"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_3"}, "inbound_nodes": [[["batchnormalization_4", 0, 0]]], "name": "dropout_3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "inbound_nodes": [[["dropout_3", 0, 0]]], "name": "activation_3"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 90, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 308}, "inbound_nodes": [[["activation_3", 0, 0]]], "name": "dense_4"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_4"}, "inbound_nodes": [[["dense_4", 0, 0]]], "name": "activation_4"}, {"class_name": "Merge", "config": {"name": "merge_2", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["model_1", 1, 0], ["activation_2", 0, 0], ["activation_4", 0, 0]]], "name": "merge_2"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_5", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 429, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 90}, "inbound_nodes": [[["merge_2", 0, 0]]], "name": "dense_5"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_5", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["dense_5", 0, 0]]], "name": "batchnormalization_5"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "inbound_nodes": [[["batchnormalization_5", 0, 0]]], "name": "activation_5"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_6", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 90, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 459}, "inbound_nodes": [[["activation_5", 0, 0]]], "name": "dense_6"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_6"}, "inbound_nodes": [[["dense_6", 0, 0]]], "name": "activation_6"}], "input_layers": [["main_input", 0, 0]], "output_layers": [["activation_2", 0, 0], ["activation_4", 0, 0], ["activation_6", 0, 0]], "name": "model_2"}}